balazsgrill/modembed/res/Devices/dsPIC33/DSPIC33FJ128MC706A.PIC
        <edc:SFRDef edc:access="--n--------rnnnn" edc:cname="OC7CON" edc:desc="" edc:impl="0x201f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--0--------00000" edc:name="OC7CON" edc:nzwidth="0x10" edc:por="--0--------00000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:aspect="Number" edc:cname="OCM" edc:desc="" edc:mask="0x7" edc:name="OCM" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:aspect="Pattern" edc:cname="OCTSEL" edc:desc="" edc:mask="0x1" edc:name="OCTSEL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:aspect="Pattern" edc:cname="OCFLT" edc:desc="" edc:mask="0x1" edc:name="OCFLT" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:aspect="Pattern" edc:cname="OCSIDL" edc:desc="" edc:mask="0x1" edc:name="OCSIDL" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="OCM0" edc:desc="" edc:mask="0x1" edc:name="OCM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OCM1" edc:desc="" edc:mask="0x1" edc:name="OCM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OCM2" edc:desc="" edc:mask="0x1" edc:name="OCM2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
          <edc:FreezeBit edc:freezeval="1" edc:name="OUTPUT COMPARE 7" edc:pos="0xe"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="OC8RS" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="OC8RS" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="OC8RS" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="OC8RS" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="OC8R" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="OC8R" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="OC8R" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="OC8R" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--n--------rnnnn" edc:cname="OC8CON" edc:desc="" edc:impl="0x201f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--0--------00000" edc:name="OC8CON" edc:nzwidth="0x10" edc:por="--0--------00000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:aspect="Number" edc:cname="OCM" edc:desc="" edc:mask="0x7" edc:name="OCM" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:aspect="Pattern" edc:cname="OCTSEL" edc:desc="" edc:mask="0x1" edc:name="OCTSEL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:aspect="Pattern" edc:cname="OCFLT" edc:desc="" edc:mask="0x1" edc:name="OCFLT" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:aspect="Pattern" edc:cname="OCSIDL" edc:desc="" edc:mask="0x1" edc:name="OCSIDL" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="OCM0" edc:desc="" edc:mask="0x1" edc:name="OCM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OCM1" edc:desc="" edc:mask="0x1" edc:name="OCM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OCM2" edc:desc="" edc:mask="0x1" edc:name="OCM2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
          <edc:FreezeBit edc:freezeval="1" edc:name="OUTPUT COMPARE 8" edc:pos="0xe"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="16"/>
        <edc:SFRDef edc:access="n-n-----nnnnnnnn" edc:cname="PTCON" edc:desc="" edc:impl="0xa0ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-0-----00000000" edc:name="PTCON" edc:nzwidth="0x10" edc:por="0-0-----00000000">
          <edc:AliasList>
            <edc:MigrationAlias edc:cname="P1TCON"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PTMOD" edc:desc="" edc:mask="0x3" edc:name="PTMOD" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="PTCKPS" edc:desc="" edc:mask="0x3" edc:name="PTCKPS" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="PTOPS" edc:desc="" edc:mask="0xf" edc:name="PTOPS" edc:nzwidth="0x4"/>
              <edc:AdjustPoint edc:offset="5"/>
              <edc:SFRFieldDef edc:cname="PTSIDL" edc:desc="" edc:mask="0x1" edc:name="PTSIDL" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PTEN" edc:desc="" edc:mask="0x1" edc:name="PTEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PTMOD0" edc:desc="" edc:mask="0x1" edc:name="PTMOD0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PTMOD1" edc:desc="" edc:mask="0x1" edc:name="PTMOD1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PTCKPS0" edc:desc="" edc:mask="0x1" edc:name="PTCKPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PTCKPS1" edc:desc="" edc:mask="0x1" edc:name="PTCKPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PTOPS0" edc:desc="" edc:mask="0x1" edc:name="PTOPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PTOPS1" edc:desc="" edc:mask="0x1" edc:name="PTOPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PTOPS2" edc:desc="" edc:mask="0x1" edc:name="PTOPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PTOPS3" edc:desc="" edc:mask="0x1" edc:name="PTOPS3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
          <edc:FreezeBit edc:freezeval="1" edc:name="PWM" edc:pos="0xe"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rnnnnnnnnnnnnnnn" edc:cname="PTMR" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="PTMR" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList>
            <edc:MigrationAlias edc:cname="P1TMR"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:aspect="Number" edc:cname="PTMR" edc:desc="" edc:mask="0x7fff" edc:name="PTMR" edc:nzwidth="0xf"/>
              <edc:SFRFieldDef edc:aspect="Pattern" edc:cname="PTDIR" edc:desc="" edc:mask="0x1" edc:name="PTDIR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnnnnnnnnnn" edc:cname="PTPER" edc:desc="" edc:impl="0x7fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-111111111111111" edc:name="PTPER" edc:nzwidth="0x10" edc:por="-111111111111111">
          <edc:AliasList>
            <edc:MigrationAlias edc:cname="P1TPER"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:aspect="Number" edc:cname="PTPER" edc:desc="" edc:mask="0x7fff" edc:name="PTPER" edc:nzwidth="0xf"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="SEVTCMP" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="SEVTCMP" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList>
            <edc:MigrationAlias edc:cname="P1SECMP"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:aspect="Number" edc:cname="SEVTCMP" edc:desc="" edc:mask="0x7fff" edc:name="SEVTCMP" edc:nzwidth="0xf"/>
              <edc:SFRFieldDef edc:aspect="Pattern" edc:cname="SEVTDIR" edc:desc="" edc:mask="0x1" edc:name="SEVTDIR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnnnnnnnnnn" edc:cname="PWMCON1" edc:desc="" edc:impl="0xfff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000qqqqqqqq" edc:name="PWMCON1" edc:nzwidth="0x10" edc:por="----0000qqqqqqqq">
          <edc:AliasList>
            <edc:MigrationAlias edc:cname="PWM1CON1"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PEN1L" edc:desc="" edc:mask="0x1" edc:name="PEN1L" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PEN2L" edc:desc="" edc:mask="0x1" edc:name="PEN2L" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PEN3L" edc:desc="" edc:mask="0x1" edc:name="PEN3L" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PEN4L" edc:desc="" edc:mask="0x1" edc:name="PEN4L" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PEN1H" edc:desc="" edc:mask="0x1" edc:name="PEN1H" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PEN2H" edc:desc="" edc:mask="0x1" edc:name="PEN2H" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PEN3H" edc:desc="" edc:mask="0x1" edc:name="PEN3H" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PEN4H" edc:desc="" edc:mask="0x1" edc:name="PEN4H" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PTMOD1" edc:desc="" edc:mask="0x1" edc:name="PTMOD1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PTMOD2" edc:desc="" edc:mask="0x1" edc:name="PTMOD2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PTMOD3" edc:desc="" edc:mask="0x1" edc:name="PTMOD3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PTMOD4" edc:desc="" edc:mask="0x1" edc:name="PTMOD4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="PMOD1" edc:desc="" edc:mask="0x1" edc:name="PMOD1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PMOD2" edc:desc="" edc:mask="0x1" edc:name="PMOD2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PMOD3" edc:desc="" edc:mask="0x1" edc:name="PMOD3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PMOD4" edc:desc="" edc:mask="0x1" edc:name="PMOD4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn-----nnn" edc:cname="PWMCON2" edc:desc="" edc:impl="0xf07" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000-----000" edc:name="PWMCON2" edc:nzwidth="0x10" edc:por="----0000-----000">
          <edc:AliasList>
            <edc:MigrationAlias edc:cname="PWM1CON2"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="UDIS" edc:desc="" edc:mask="0x1" edc:name="UDIS" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OSYNC" edc:desc="" edc:mask="0x1" edc:name="OSYNC" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IUE" edc:desc="" edc:mask="0x1" edc:name="IUE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="5"/>
              <edc:SFRFieldDef edc:cname="SEVOPS" edc:desc="" edc:mask="0xf" edc:name="SEVOPS" edc:nzwidth="0x4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="SEVOPS0" edc:desc="" edc:mask="0x1" edc:name="SEVOPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEVOPS1" edc:desc="" edc:mask="0x1" edc:name="SEVOPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEVOPS2" edc:desc="" edc:mask="0x1" edc:name="SEVOPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEVOPS3" edc:desc="" edc:mask="0x1" edc:name="SEVOPS3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="DTCON1" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="DTCON1" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList>
            <edc:MigrationAlias edc:cname="P1DTCON1"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DTA" edc:desc="" edc:mask="0x3f" edc:name="DTA" edc:nzwidth="0x6"/>
              <edc:SFRFieldDef edc:cname="DTAPS" edc:desc="" edc:mask="0x3" edc:name="DTAPS" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="DTB" edc:desc="" edc:mask="0x3f" edc:name="DTB" edc:nzwidth="0x6"/>
              <edc:SFRFieldDef edc:cname="DTBPS" edc:desc="" edc:mask="0x3" edc:name="DTBPS" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="DTA0" edc:desc="" edc:mask="0x1" edc:name="DTA0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DTA1" edc:desc="" edc:mask="0x1" edc:name="DTA1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DTA2" edc:desc="" edc:mask="0x1" edc:name="DTA2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DTA3" edc:desc="" edc:mask="0x1" edc:name="DTA3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DTA4" edc:desc="" edc:mask="0x1" edc:name="DTA4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DTA5" edc:desc="" edc:mask="0x1" edc:name="DTA5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DTAPS0" edc:desc="" edc:mask="0x1" edc:name="DTAPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DTAPS1" edc:desc="" edc:mask="0x1" edc:name="DTAPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DTB0" edc:desc="" edc:mask="0x1" edc:name="DTB0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DTB1" edc:desc="" edc:mask="0x1" edc:name="DTB1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DTB2" edc:desc="" edc:mask="0x1" edc:name="DTB2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DTB3" edc:desc="" edc:mask="0x1" edc:name="DTB3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DTB4" edc:desc="" edc:mask="0x1" edc:name="DTB4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DTB5" edc:desc="" edc:mask="0x1" edc:name="DTB5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DTBPS0" edc:desc="" edc:mask="0x1" edc:name="DTBPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DTBPS1" edc:desc="" edc:mask="0x1" edc:name="DTBPS1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--------nnnnnnnn" edc:cname="DTCON2" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------00000000" edc:name="DTCON2" edc:nzwidth="0x10" edc:por="--------00000000">
          <edc:AliasList>
            <edc:MigrationAlias edc:cname="P1DTCON2"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DTS1I" edc:desc="" edc:mask="0x1" edc:name="DTS1I" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DTS1A" edc:desc="" edc:mask="0x1" edc:name="DTS1A" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DTS2I" edc:desc="" edc:mask="0x1" edc:name="DTS2I" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DTS2A" edc:desc="" edc:mask="0x1" edc:name="DTS2A" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DTS3I" edc:desc="" edc:mask="0x1" edc:name="DTS3I" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DTS3A" edc:desc="" edc:mask="0x1" edc:name="DTS3A" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DTS4I" edc:desc="" edc:mask="0x1" edc:name="DTS4I" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DTS4A" edc:desc="" edc:mask="0x1" edc:name="DTS4A" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnn---nnnn" edc:cname="FLTACON" edc:desc="" edc:impl="0xff8f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000000000---0000" edc:name="FLTACON" edc:nzwidth="0x10" edc:por="000000000---0000">
          <edc:AliasList>
            <edc:MigrationAlias edc:cname="P1FLTACON"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FAEN1" edc:desc="" edc:mask="0x1" edc:name="FAEN1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FAEN2" edc:desc="" edc:mask="0x1" edc:name="FAEN2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FAEN3" edc:desc="" edc:mask="0x1" edc:name="FAEN3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FAEN4" edc:desc="" edc:mask="0x1" edc:name="FAEN4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="FLTAM" edc:desc="" edc:mask="0x1" edc:name="FLTAM" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FAOV1L" edc:desc="" edc:mask="0x1" edc:name="FAOV1L" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FAOV1H" edc:desc="" edc:mask="0x1" edc:name="FAOV1H" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FAOV2L" edc:desc="" edc:mask="0x1" edc:name="FAOV2L" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FAOV2H" edc:desc="" edc:mask="0x1" edc:name="FAOV2H" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FAOV3L" edc:desc="" edc:mask="0x1" edc:name="FAOV3L" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FAOV3H" edc:desc="" edc:mask="0x1" edc:name="FAOV3H" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FAOV4L" edc:desc="" edc:mask="0x1" edc:name="FAOV4L" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FAOV4H" edc:desc="" edc:mask="0x1" edc:name="FAOV4H" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="FAEN" edc:desc="" edc:islanghidden="true" edc:mask="0xf" edc:name="FAEN" edc:nzwidth="4"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnn---nnnn" edc:cname="FLTBCON" edc:desc="" edc:impl="0xff8f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000000000---0000" edc:name="FLTBCON" edc:nzwidth="0x10" edc:por="000000000---0000">
          <edc:AliasList>
            <edc:MigrationAlias edc:cname="P1FLTBCON"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FBEN1" edc:desc="" edc:mask="0x1" edc:name="FBEN1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FBEN2" edc:desc="" edc:mask="0x1" edc:name="FBEN2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FBEN3" edc:desc="" edc:mask="0x1" edc:name="FBEN3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FBEN4" edc:desc="" edc:mask="0x1" edc:name="FBEN4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="FLTBM" edc:desc="" edc:mask="0x1" edc:name="FLTBM" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FBOV1L" edc:desc="" edc:mask="0x1" edc:name="FBOV1L" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FBOV1H" edc:desc="" edc:mask="0x1" edc:name="FBOV1H" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FBOV2L" edc:desc="" edc:mask="0x1" edc:name="FBOV2L" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FBOV2H" edc:desc="" edc:mask="0x1" edc:name="FBOV2H" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FBOV3L" edc:desc="" edc:mask="0x1" edc:name="FBOV3L" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FBOV3H" edc:desc="" edc:mask="0x1" edc:name="FBOV3H" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FBOV4L" edc:desc="" edc:mask="0x1" edc:name="FBOV4L" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FBOV4H" edc:desc="" edc:mask="0x1" edc:name="FBOV4H" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="FBEN" edc:desc="" edc:islanghidden="true" edc:mask="0xf" edc:name="FBEN" edc:nzwidth="4"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
