balazsgrill/modembed/res/Devices/dsPIC33/DSPIC33FJ128MC706A.PIC
        <edc:SFRDef edc:access="--------nnnnnnnn" edc:cname="TRISE" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------11111111" edc:name="TRISE" edc:nzwidth="0x10" edc:por="--------11111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TRISE0" edc:desc="" edc:mask="0x1" edc:name="TRISE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISE1" edc:desc="" edc:mask="0x1" edc:name="TRISE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISE2" edc:desc="" edc:mask="0x1" edc:name="TRISE2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISE3" edc:desc="" edc:mask="0x1" edc:name="TRISE3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISE4" edc:desc="" edc:mask="0x1" edc:name="TRISE4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISE5" edc:desc="" edc:mask="0x1" edc:name="TRISE5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISE6" edc:desc="" edc:mask="0x1" edc:name="TRISE6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISE7" edc:desc="" edc:mask="0x1" edc:name="TRISE7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="TRISE" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="TRISE" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--------nnnnnnnn" edc:cname="PORTE" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------uuuuuuuu" edc:name="PORTE" edc:nzwidth="0x10" edc:por="--------xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RE0" edc:desc="" edc:mask="0x1" edc:name="RE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE1" edc:desc="" edc:mask="0x1" edc:name="RE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE2" edc:desc="" edc:mask="0x1" edc:name="RE2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE3" edc:desc="" edc:mask="0x1" edc:name="RE3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE4" edc:desc="" edc:mask="0x1" edc:name="RE4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE5" edc:desc="" edc:mask="0x1" edc:name="RE5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE6" edc:desc="" edc:mask="0x1" edc:name="RE6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE7" edc:desc="" edc:mask="0x1" edc:name="RE7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="RE" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="RE" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--------nnnnnnnn" edc:cname="LATE" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------00000000" edc:name="LATE" edc:nzwidth="0x10" edc:por="--------00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LATE0" edc:desc="" edc:mask="0x1" edc:name="LATE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATE1" edc:desc="" edc:mask="0x1" edc:name="LATE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATE2" edc:desc="" edc:mask="0x1" edc:name="LATE2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATE3" edc:desc="" edc:mask="0x1" edc:name="LATE3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATE4" edc:desc="" edc:mask="0x1" edc:name="LATE4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATE5" edc:desc="" edc:mask="0x1" edc:name="LATE5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATE6" edc:desc="" edc:mask="0x1" edc:name="LATE6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATE7" edc:desc="" edc:mask="0x1" edc:name="LATE7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="LATE" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="LATE" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---------nnnnnnn" edc:cname="TRISF" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------1111111" edc:name="TRISF" edc:nzwidth="0x10" edc:por="---------1111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TRISF0" edc:desc="" edc:mask="0x1" edc:name="TRISF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISF1" edc:desc="" edc:mask="0x1" edc:name="TRISF1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISF2" edc:desc="" edc:mask="0x1" edc:name="TRISF2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISF3" edc:desc="" edc:mask="0x1" edc:name="TRISF3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISF4" edc:desc="" edc:mask="0x1" edc:name="TRISF4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISF5" edc:desc="" edc:mask="0x1" edc:name="TRISF5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISF6" edc:desc="" edc:mask="0x1" edc:name="TRISF6" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="TRISF" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="TRISF" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---------nnnnnnn" edc:cname="PORTF" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------uuuuuuu" edc:name="PORTF" edc:nzwidth="0x10" edc:por="---------xxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RF0" edc:desc="" edc:mask="0x1" edc:name="RF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF1" edc:desc="" edc:mask="0x1" edc:name="RF1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF2" edc:desc="" edc:mask="0x1" edc:name="RF2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF3" edc:desc="" edc:mask="0x1" edc:name="RF3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF4" edc:desc="" edc:mask="0x1" edc:name="RF4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF5" edc:desc="" edc:mask="0x1" edc:name="RF5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF6" edc:desc="" edc:mask="0x1" edc:name="RF6" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="RF" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="RF" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---------nnnnnnn" edc:cname="LATF" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------0000000" edc:name="LATF" edc:nzwidth="0x10" edc:por="---------0000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LATF0" edc:desc="" edc:mask="0x1" edc:name="LATF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATF1" edc:desc="" edc:mask="0x1" edc:name="LATF1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATF2" edc:desc="" edc:mask="0x1" edc:name="LATF2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATF3" edc:desc="" edc:mask="0x1" edc:name="LATF3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATF4" edc:desc="" edc:mask="0x1" edc:name="LATF4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATF5" edc:desc="" edc:mask="0x1" edc:name="LATF5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATF6" edc:desc="" edc:mask="0x1" edc:name="LATF6" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="LATF" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="LATF" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="------nnnn--nn--" edc:cname="TRISG" edc:desc="" edc:impl="0x3cc" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------1111--11--" edc:name="TRISG" edc:nzwidth="0x10" edc:por="------1111--11--">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="TRISG2" edc:desc="" edc:mask="0x1" edc:name="TRISG2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISG3" edc:desc="" edc:mask="0x1" edc:name="TRISG3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="TRISG6" edc:desc="" edc:mask="0x1" edc:name="TRISG6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISG7" edc:desc="" edc:mask="0x1" edc:name="TRISG7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISG8" edc:desc="" edc:mask="0x1" edc:name="TRISG8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISG9" edc:desc="" edc:mask="0x1" edc:name="TRISG9" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="TRISG" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="TRISG" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
